---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExtrusionRoof
source: html/51c8b2ea-b8c9-5aa1-ec03-3f76bdc4b2bc.htm
---
# ExtrusionRoof Properties

The id of the assembly instance to which the element belongs.